["Hello! How can I help you?",
  "Hi! How can I assist you today?",
  "Hey! What's up?",
  "I'm just a chatbot, but I'm doing great! How can I assist you?",
  "I am UBI Customer Care Chatbot.",
  "You're welcome! Let me know if you need anything else.",
  "Goodbye! Have a great day.",
  "Bye! Take care.",
  "I'm not sure, but I can answer your questions!",
  "I can answer your questions about Union Bank, reset passwords, and more.",
    "UBI Vyom App is the official mobile application of Union Bank of India.",
    "Go to settings and select reset password.",
    "Call 1800-1234-567 or email customercare@ubi.com.","You can open a savings account by visiting near bank",
  "Saving is the surplus money that remains when income exceeds expenses.",
  "We should save money regularly to meet various expenses, emergencies, and life events, such as education, marriage, house purchase, birth, illness, accident, death, natural calamity, and old age. During emergencies, savings can be a great help.",
"We usually keep money at home in a Gulak (piggy bank), but it may not be safe or may be tempting to use. Also, money saved at home does not increase. Therefore, it's better to save money in a bank.",
"Money saved in a bank is safe, secure, and reliable.",
  "Having a bank account allows us to open savings, recurring, or fixed deposit accounts. Banks offer loans and many other useful services. We can have our wages or salaries directly credited to our bank account. Also, all social benefits like MGNREGA wages, pensions, etc. can be directly credited to the bank account through EBT. We can deposit or withdraw money from our bank account at our convenience. Banks do not charge any fee for depositing money but pay interest on the money deposited. Moreover, having a bank account gives us an identity recognized by other government agencies.",
"Interest is the amount earned on the deposit kept with the bank or the amount paid when the money is borrowed from the bank. The interest charged by the bank is much less than the interest charged by the moneylender (Sahukar).",
"A Basic Savings Bank Deposit Account can be opened with simplified KYC norms. Banks cannot charge fees for depositing money any number of times, and they do not charge for four withdrawals in a month. The customer is provided with a Passbook and an ATM card without any fees. The account can be used for everyday transactions such as deposits, withdrawals, remittances, and direct credit of social benefits.",
"An overdraft is a small loan built into a savings bank account to cover emergent miscellaneous needs. The account holder can withdraw an amount up to the overdraft limit without going through separate documentation for availing of a small amount. The customer is required to pay interest on the overdraft amount as it is a loan given by the bank. Other loans like KCC and GCC are provided by the banks for the specific purpose of income-generating activities.",
"Nomination is a facility that allows a deposit holder to designate an individual who can claim the amount in the bank account in case of the account holder's death. It is advisable to nominate someone in a bank account to make it easier for the nominated person to claim the amount.",
"Banks are required to know the customer's particulars before opening accounts as per KYC regulations. Necessary KYC documents, such as a photograph, proof of identity, and proof of residence, must be submitted to the bank along with the account opening form. Accounts can also be opened based on the Aadhaar Card. Those who do not have the required documents may open an account under the relaxed KYC procedure based on the MGNREGA job card or self-certification. Accounts opened under the relaxed procedure will be treated as small accounts and subject to certain limitations.",
"Debt is borrowing raised to fill the gap between resources and expenses. When expenses exceed income, and there are no savings, borrowing is used to cover the shortage, creating debt.",
"It is a plan to assist those in financial distress by creating a suitable repayment plan. A counsellor would assist the customer in understanding financial budgeting and finding a way to reduce or lessen the burden of debt.",
  "Money can be managed efficiently by doing financial planning. The first step in financial planning is to maintain a Financial Diary to keep track of income and expenses for a given period, such as a week or a month.",
"SLBC stands for State Level Bankers Committee, which is an inter-institutional forum at the state level that ensures coordination between the government and banks on matters related to banking development. A designated bank serves as the Convener Bank for a particular state or union territory.",
  "An ATM (Automated Teller Machine) is a self-service banking terminal that allows you to withdraw cash, check your account balance, transfer funds, and more.",
"Union Bank ATMs are strategically located across India. You can find the nearest ATM using our website or mobile app's ATM locator feature.",
"Yes, you can withdraw cash from any Union Bank ATM using your debit card, subject to sufficient funds in your account.",
  "Union Bank offers a certain number of free transactions per month, and additional transactions may be subject to nominal charges.",
"The maximum withdrawal limit per transaction varies based on your account type and the ATM's limits.",
"Yes, you can transfer funds to other Union Bank accounts or third-party accounts using the NEFT/IMPS option available at ATMs.",
"You can check your account balance by selecting the \"Balance Inquiry\" option and entering your debit card PIN.",
"Yes, you can change your ATM PIN for enhanced security by selecting the \"Change PIN\" option and following the instructions.",
"In case of a lost or stolen card, immediately contact our customer support or block your card through internet banking/mobile app to prevent unauthorized use.",
"Cardless cash withdrawals allow you to withdraw money from an ATM without using a physical debit card. You can generate a one-time code through our mobile app to authorize the withdrawal."


]
